Repository: KDE/pumoku
Catalog: po/*/pumoku.po
Languages: ar, ca, de, es, eu, fi, fr, he, it, ka, nl, pt_br, sl, tr, uk, zh_tw

source: There is your solution
ar: ها هو الحل
ca: Aquesta és la solució
de: Hier ist Ihre Lösung
es: Esta es la solución
eu: Hor dago zure ebazpena
fi: Tässä on ratkaisusi
fr: Il y a votre solution
he: הינה הפתרון שלך
it: Ecco la tua soluzione
ka: ეს თქვენი გამოსავალია
nl: Daar is uw oplossing
pt_br: Aí está a sua solução
sl: Tu je vaša rešitev
tr: İşte çözüm
uk: Є ваш розв'язок

# %1 is step count
source: You gave in after %1 steps.
ar: استسلمت بعد %1 خطوة.
ca: Heu renunciat després de %1 passos.
de: Sie haben nach %1 Schritten aufgegeben.
es: Has abandonado tras %1 pasos.
eu: %1 urrats ondoren amore eman duzu.
fi: Luovutit %1 vaiheessa.
fr: Vous avez renoncé après %1 étapes.
he: נכנעת אחרי %1 צעדים.
it: Hai rinunciato dopo %1 passaggi.
ka: თქვენ დანებდით %1 ნაბიჯის შემდეგ.
nl: U gaf op na %1 stappen.
pt_br: Você desistiu depois de %1 passos.
sl: Oddali ste jo po %1 korakih.
tr: %1 adımdan sonra bıraktınız
uk: Ви здалися за %1 кроків.

# %1 is hint count
source: Automatically solved. Hints: %1.
ar: أُحلت آليًا. تلميحات: %1.
ca: S'ha resolt automàticament. Pistes: %1.
de: Automatisch gelöst. Hinweise: %1.
es: Resuelto automáticamente. Pistas: %1
eu: Automatikoki ebatzia. Argibideak: %1.
fi: Ratkaistiin automaattisesti. Vihjeet: %1.
fr: Résolu automatiquement. Astuces : %1.
he: נפתר אוטומטית. רמזים: %1.
it: Risolto automaticamente. Suggerimenti: %1.
ka: ავტომატურად ამოიხსნა. მინიშნებები: %1.
nl: Automatisch opgelost. Tips: %1.
pt_br: Resolvido automaticamente. Dicas: %1.
sl: Samodejno rešeno. Namigi: %1.
tr: Kendiliğinden çözüldü. İpuçları: %1.
uk: Розв'язано автоматично. Підказки: %1.

source: Well done!
ar: أحسنت عملًا!
ca: Ben fet!
de: Gut gemacht!
es: ¡Bien hecho!
eu: Ondo egina!
fi: Hyvää työtä!
fr: Bien joué !
he: כל הכבוד!
it: Ben fatto!
ka: ყოჩაღ!
nl: Goed gedaan!
pt_br: Muito bem!
sl: Odlično narejeno!
tr: Aferin!
uk: Добре!
zh_tw: 做得好！

# %1 is level name, %2 is step count
source: You finished this %1 Sudoku (with a bit of help) using %2 steps.
ar: أنهيت هذا اللغز %1 سودوكو (بقليل من المساعدة) باستخدام %2 خطوات.
ca: Heu acabat aquest Sudoku %1 (amb una mica d'ajuda) fent servir %2 passos.
de: Sie haben dieses Sudoku (%1) mit ein bisschen Hilfe in %2 Schritten gelöst.
es: Has terminado este sudoku %1 (con algo de ayuda) en %2 pasos.
eu: %1 Sudoku hau (laguntza pixka batekin) %2 urratsetan ebatzi duzu.
fi: Pääsit loppuun tämän %1-sudokun (pienellä avustuksella) %2 vaiheessa.
fr: Vous avez terminé ce %1 sudoku (avec un peu d'aide) en %2 étapes.
he: סיימת את הסודוקו ה%1 הזה (עם קצת עזרה) תוך %2 שלבים.
it: Hai completato questo Sudoku %1 (con un po' di aiuto) usando %2 passaggi.
ka: თქვენ დაასრულეთ ეს %1 სუდოკუ (ცოტა დახმარებით) %2 ნაბიჯით.
nl: U beëindigde deze %1 Suduko (met een beetje hulp) met gebruik van %2 stappen.
pt_br: Você terminou este %1 sudoku (com um pouco de ajuda) usando %2 passos.
sl: Končali ste ta %1 Sudoku (z malo pomoči) v %2 korakih.
tr: Bu %1 Sudoku’yu (biraz da yardımla) %2 adımda bitirdiniz.
uk: Вами завершено це судоку %1 (з певною допомогою) з використанням %2 кроків.

source: Auto pencilmarks used.
ar: استخدمت علامات قلم رصاص آلي.
ca: S'han utilitzat marques de llapis automàtiques.
de: Automatische Hilfszahlen verwendet.
es: Se han usado marcas de lápiz automáticas.
eu: Arkatz-ohar automatikoak erabili dira.
fi: Käytettiin automaattisia kynänjälkiä.
fr: Marques automatiques utilisées.
he: נעשה שימוש בסימוני עיפרון אוטומטיים.
it: Sono stati utilizzati segni a matita automatici.
ka: გამოყენებულია ავტომატური ფანქრის კვლები.
nl: Automatische potloodmarkeringen gebruikt.
pt_br: Marcas de lápis automáticas usadas.
sl: Uporabljene so samodejne oznake s svinčnikom.
tr: Otomatik kalem imleri kullanıldı.
uk: Використано автоматичні позначки олівцем.

# %1 is hint count
source: Hints: %1.
ar: تلميحات: %1.
ca: Pistes: %1.
de: Hinweise: %1.
es: Pistas: %1
eu: Argibideak: %1.
fi: Vihjeet: %1.
fr: Astuces : %1.
he: רמזים: %1.
it: Suggerimenti: %1.
ka: მინიშნებები: %1.
nl: Tips: %1.
pt_br: Dicas: %1.
sl: Namigi: %1.
tr: İpuçları: %1.
uk: Підказки: %1 .

source: CONGRATULATIONS!!
ar: تَهَانِينَا!!
ca: ENHORABONA!!
de: Herzlichen Glückwunsch!
es: ¡Enhorabuena!
eu: ZORIONAK!!
fi: ONNEA!!
fr: FÉLICITATIONS !
he: כל הכבוד!!
it: CONGRATULAZIONI!!
ka: გილოცავთ!!
nl: GEFELICITEERD!!
pt_br: PARABÉNS!
sl: ČESTITKE!!
tr: TEBRİKLER!
uk: ВІТАЄМО!
zh_tw: 恭喜！

# %1 is level name, %2 is step count
source: You finished this %1 Sudoku with no hints or help using %2 steps.
ar: أنهيت لعبة سودوكو هذه بنسبة %1 دون أي تلميحات أو مساعدة باستخدام %2 خطوات.
ca: Heu acabat aquest Sudoku %1 sense pistes ni ajuda fent servir %2 passos.
de: Sie haben dieses Sudoku (%1) ohne Hinweise oder Hilfe in %2 Schritten gelöst.
es: Has terminado este sudoku %1 sin pistas ni ayuda en %2 pasos.
eu: %1 Sudoku hau argibiderik edo laguntzarik gabe %2 urratsetan ebatzi duzu.
fi: Pääsit loppuun tämän %1-sudokun avustuksetta ja ohjeitta %2 vaiheessa.
fr: Vous avez terminé ce %1 sudoku sans aucun indice ou aide en %2 étapes.
he: סיימת את הסודוקו ה%1 הזה ללא רמזים או עזרה תוך %2 שלבים.
it: Hai completato questo Sudoku %1 senza suggerimenti o aiuto utilizzando %2 passaggi.
ka: თქვენ დაასრულეთ ეს %1 სუდოკუ დახმარების გარეშე %2 ნაბიჯით.
nl: U beëindigde deze %1 Suduko zonder tips of hulp met gebruik van %2 stappen.
pt_br: Você completou este %1 sudoku sem dicas ou ajuda usando %2 passos.
sl: Končali ste ta %1 Sudoku brez namigov ali pomoči v %2 korakih.
tr: Bu %1 Sudoku’yu ipucu veya yardım olmadan %2 adımda bitirdiniz.
uk: Вами завершено це судоку %1 без підказок або допомоги з використанням %2 кроків.

# @action:button
source: Undo
ar: تراجع
ca: Desfés
de: Rückgängig
es: Deshacer
eu: Desegin
fi: Kumoa
fr: Annuler
he: הסגה
it: Annulla
ka: დაბრუნება
nl: Ongedaan maken
pt_br: Desfazer
sl: Razveljavi
tr: Geri Al
uk: Скасувати

# @action:button
source: Redo
ar: كرّر
ca: Refés
de: Wiederherstellen
es: Rehacer
eu: Berregin
fi: Tee uudelleen
fr: Refaire
he: ביצוע מחדש
it: Rifai
ka: გამეორება
nl: Opnieuw
pt_br: Refazer
sl: Uveljavi
tr: Yinele
uk: Повторити

# @action:button
source: Hint
ar: تلميح
ca: Pista
de: Hinweis
es: Pista
eu: Argibidea
fi: Vihje
fr: Astuce
he: רמז
it: Suggerimento
ka: მინიშნება
nl: Tip
pt_br: Dica
sl: Namig
tr: İpucu
uk: Підказка

# @action:inmenu
source: Solve Cell
ar: حلّ الخلية
ca: Soluciona la cel·la
de: Zelle lösen
es: Resolver celda
eu: Gelaxka ebatzi
fi: Ratkaise solu
fr: Résoudre la cellule
he: פתרון תא
it: Risolvi la cella
ka: უჯრედის ამოხსნა
nl: Cel oplossen
pt_br: Solucionar célula
sl: Reši celico
tr: Hücreyi Çöz
uk: Розв'язати комірку

# @action:inmenu
source: Set Pencilmarks
ar: ضع علامات قلم رصاص
ca: Estableix les marques de llapis
de: Hilfszahlen festlegen
es: Definir marcas de lápiz
eu: Ezarri Arkatz-oharrak
fi: Aseta kynänjäljet
fr: Mettre des marques
he: הגדרת סימון בעיפרון
it: Imposta segni a matita
ka: ფანქრის კვლების დაყენება
nl: Potloodmarkering zetten
pt_br: Definir marcas de lápis
sl: Nastavi oznake s svinčnikom
tr: Kalem İmleri Koy
uk: Встановити позначки олівцем

# @action:button
source: Pencil
ar: قلم رصاص
ca: Llapis
de: Hilfszahlen
es: Lápiz
eu: Arkatza
fi: Kynä
fr: Crayon
he: עיפרון
it: Matita
ka: ფანქარი
nl: Potlood
pt_br: Lápis
sl: Svinčnik
tr: Kalem
uk: Олівець

# @action:button
source: Erase
ar: امسح
ca: Esborra
de: Löschen
es: Borrar
eu: Ezabatu
fi: Pyyhi
fr: Effacer
he: מחיקה
it: Cancella
ka: წაშლა
nl: Wissen
pt_br: Apagar
sl: Izbriši
tr: Silgi
uk: Витерти

# @action:button
source: Game
ar: لعبة جديدة
ca: Partida
de: Spiel
es: Juego
eu: Jokoa
fi: Peli
fr: Jeu
he: משחק
it: Partita
ka: თამაში
nl: Spel
pt_br: Jogo
sl: Igra
tr: Oyun
uk: Гра

# @action:inmenu
source: Reset Game
ar: صفّر اللعبة
ca: Reinicia la partida
de: Spiel zurücksetzen
es: Reiniciar el juego
eu: Jokoa berrezarri
fi: Palauta peli
fr: Réinitialiser le jeu
he: איפוס משחק
it: Ripristina la partita
ka: თამაშის გადატვირთვა
nl: Spel resetten
pt_br: Reiniciar jogo
sl: Ponastavi igro
tr: Oyunu Sıfırla
uk: Відновити початковий стан гри

# @title:window
source: Reset Game?
ar: أأصفّر اللعبة؟
ca: Reinicio la partida?
de: Spiel zurücksetzen?
es: ¿Reiniciar el juego?
eu: Jokoa berrezarri?
fi: Palautetaanko peli?
fr: Réinitialiser le jeu ?
he: לאפס את המשחק?
it: Vuoi ripristinare la partita?
ka: გადავტვირთო თამაში?
nl: Spel resetten?
pt_br: Reiniciar jogo?
sl: Naj ponastavim igro?
tr: Oyunu Sıfırla?
uk: Відновити початковий стан гри?

source: You will lose any changes you have made, this cannot be undone.
ar: ستفقد أي تغييرات قمت بها، ولا يمكن التراجع عن ذلك.
ca: Perdeu els canvis que heu fet, això no es pot desfer.
de: Alle von Ihnen durchgeführten Änderungen gehen verloren. Dies kann nicht rückgangig gemacht werden.
es: Perderás los cambios que hayas hecho. Esta acción no se puede deshacer.
eu: Egindako aldaketak galduko dituzu, ez du atzera bueltarik.
fi: Menetät tekemäsi muutokset, eikä tätä voi kumota.
fr: Vous perdez toutes vos modifications. Il est impossible d'annuler cette action.
he: כל השינויים שערכת יאבדו, זאת פעולה בלתי הפיכה.
it: Tutte le modifiche apportate andranno perse, questo può essere annullato.
ka: თქვენ დაკარგავთ თქვენს მიერ განხორციელებულ ცვლილებებს. ეს ქმედება შეუქცევადია.
nl: U zult elke wijziging die u hebt gemaakt verliezen, reset kan niet ongedaan gemaakt worden.
pt_br: Você perderá todas as alterações feitas; a redefinição não pode ser desfeita.
sl: Izgubilo boste vse spremembe, ki ste jih naredili, tega ni mogoče razveljaviti.
tr: Yaptığınız herhangi bir değişiklik kaybolacak; bu, geri alınamaz.
uk: Ви втратите усі внесені зміни, скидання не можна буде скасувати.

# @action:inmenu
source: Clear Pencilmarks
ar: امحُ علامات قلم رصاص
ca: Neteja les marques de llapis
de: Hilfszahlen leeren
es: Borrar marcas de lápiz
eu: Garbitu arkatz-oharrak
fi: Pyyhi kynänjäljet
fr: Effacer les marques
he: מחיקת סימוני עיפרון
it: Cancella segni a matita
ka: ფანქრის კვლების გასუფთავება
nl: Potloodmarkeringen wissen
pt_br: Limpar marcas de lápis
sl: Počisti oznake svinčnika
tr: Kalem İmlerini Temizle
uk: Зняти позначки олівцем

# @action:inmenu
source: Give Up
ar: استسلم
ca: Renuncio
de: Aufgeben
es: Abandonar
eu: Amore eman
fi: Luovuta
fr: Abandonner
he: כניעה
it: Rinucia
ka: დანებება
nl: Opgeven
pt_br: Desistir
sl: Odneham
tr: Bırak
uk: Здатися

# @title:window
source: Give Up?
ar: استسلم؟
ca: Renuncieu?
de: Aufgeben?
es: ¿Abandonar?
eu: Amore eman?
fi: Luovutetaanko?
fr: Abandonner ?
he: להיכנע?
it: Vuoi rinunciare?
ka: ნებდებით?
nl: Opgeven?
pt_br: Desistir
sl: Naj odneham?
tr: Oyunu Bırak?
uk: Здатися?

# @action:inmenu
source: Solve Game
ar: حل اللعبة
ca: Resol la partida
de: Spiel lösen
es: Resolver el juego
eu: Jokoa ebatzi
fi: Ratkaise peli
fr: Résoudre la partie
he: פתרון המשחק
it: Risolvi partita
ka: თამაშის ამოხსნა
nl: Spel oplossen
pt_br: Solucionar jogo
sl: Reši igro
tr: Oyunu Çöz
uk: Розв'язати гру

# @title:window
source: Solve Game?
ar: أأحل اللعبة؟
ca: Resolc la partida?
de: Spiel lösen?
es: ¿Resolver el juego?
eu: Jokoa ebatzi?
fi: Ratkaistaanko peli?
fr: Résoudre la partie ?
he: לפתור את המשחק?
it: Vuoi risolvere la partita?
ka: ამოიხსნას თამაში?
nl: Spel oplossen?
pt_br: Solucionar jogo?
sl: Naj rešim igro?
tr: Oyunu Çöz?
uk: Розв'язати гру?

source: You will lose any changes you have made, this cannot be undone. You can’t solve the puzzle on your own!
ar: ستفقد أي تغييرات قمت بها، ولا يمكن التراجع عن ذلك. لا يمكنك حل اللغز بنفسك!
ca: Perdreu qualsevol canvi que hàgiu fet, això no es pot desfer. No podreu resoldre el puzle pel vostre compte!
de: Alle von Ihnen durchgeführten Änderungen gehen verloren. Dies kann nicht rückgangig gemacht werden. Sie können das Rätsel nicht selbst lösen!
es: Perderás todos los cambios que hayas hecho. Esta acción no se puede deshacer. No podrás resolver el juego por ti mismo.
eu: Egindako aldaketak galduko dituzu, ez du atzera bueltarik. Ezin duzu zeure kabuz buru-hausgarria ebatzi!
fi: Menetät tekemäsi muutokset, eikä tätä voi kumota. Et voi ratkaista peliä omillasi!
fr: vous perdez toutes vos modifications. Il est impossible d'annuler cette action. Vous ne pouvez pas résoudre le puzzle par vous-même !
he: כל השינויים שביצעת יאבדו, התהליך הזה הוא בלתי הפיך. לא תהיה לך אפשרות לפתור את החידה בעצמך!
it: Perderai tutte le modifiche apportate, questo non può essere annullato. Non potrai risolvere il rompicapo da solo!
ka: თქვენ კარგავთ თქვენს მიერ განხორციელებულ ცვლილებებს და ვერ გადაჭრით თავსატეხს დამოუკიდებლად!
nl: u zult elke wijziging die u hebt gemaakt verliezen, dit kan niet ongedaan worden gemakt. U kunt de puzzel niet zelfstandig oplossen!
pt_br: Você perderá todas as alterações que fez e isso não poderá ser desfeito. Você não consegue resolver o quebra-cabeça sozinho!
sl: Izgubili boste vse spremembe, ki ste jih naredili, tega ni mogoče razveljaviti. Uganke ne morete rešiti sami!
tr: Yaptığınız herhangi bir değişiklik kaybolacak; bu, geri alınamaz. Oyunu kendi başınıza çözemiyorsunuz!
uk: Ви втратите усі внесені зміни, результати дії не можна буде скасувати. Ви не зможете виграти гру власноруч!

# @action:button, %1 is level name
source: Another %1
ar: %1 آخر
ca: Un altre %1
de: Noch einmal %1
es: Otro %1
eu: Beste %1 bat
fi: Toinen %1
fr: Un autre %1
he: %1 נוסף
it: Un altro %1
ka: კიდევ ერთი %1
nl: Nog een %1
pt_br: Outro %1
sl: Še ena %1
tr: Başka %1
uk: Ще один %1

# @action:button
source: Main Menu
es: Menú principal
tr: Ana Menü

# @title:window
source: Import Sudoku
ar: استيراد سودوكو
ca: Importa un Sudoku
de: Sudoku importieren
es: Importar sudoku
eu: Inportatu Sudoku
fi: Tuo sudoku
fr: Importer un sudoku
he: ייבוא סודוקו
it: Importa Sudoku
ka: სუდოკუს შემოტანა
nl: Sudoku importeren
pt_br: Importar sudoku
sl: Uvozi sudoku
tr: Sudoku İçe Aktar
uk: Імпортувати судоку

# Use en dash for number range
source: Enter or paste a string of 81 characters. 1–9 for given cells, 0 or any single non-numeric character except space will do for blanks cells. PuMoKu will check that the Sudoku is solvable and calculate the level. Line breaks and spaces are silently removed, so that you can enter one row per-line with some optional whitespace.
ar: أدخل أو الصق سلسلة من 81 حرفًا. 1–9 للخلايا المحددة، و 0 أو أي حرف غير رقمي باستثناء المسافة للخلايا الفارغة. سيتحقق بوموكو من إمكانية حل سوودوكو ويحسب المستوى. تحذف فواصل الأسطر والمسافات آليًا، بحيث يمكنك إدخال صف واحد في كل سطر مع بعض المسافات البيضاء الاختيارية.
ca: Introduïu o enganxeu una cadena de 81 caràcters. 1–9 per a cel·les indicades, 0 o qualsevol caràcter no numèric excepte l'espai ho farà per a cel·les en blanc. El PuMoKu comprovarà que el sudoku sigui resoluble i calcularà el nivell. Els salts de línia i els espais s'eliminen en silenci, de manera que podeu introduir una línia per fila amb algun espai en blanc opcional.
de: Geben Sie hier eine 81 Zeichen lange Zeichenkette ein. Verwenden Sie 1–9 für ausgefüllte Zellen und 0 oder ein beliebiges nicht-numerisches Zeichen (außer Leerzeichen) für leere Zellen. PuMoKu prüft die Lösbarkeit des Sudokus und berechnet den Schwierigkeitsgrad. Zeilenumbrüche und Leerzeichen werden automatisch entfernt, sodass Sie eine Sudoku-Zeile pro Zeile mit optionalen Leerzeichen eingeben können.
es: Introduce o pega una cadena de 81 caracteres: 1–9 para las celdas, 0 o cualquier carácter no numérico (excepto el espacio) servirá para las celdas en blanco. PuMoKu comprobará que el sudoku se puede resolver y calculará el nivel. Los saltos de línea y los espacios se ignoran, por lo que se puede introducir una fila por línea con varios espacios en blanco opcionales.
eu: Sartu edo itsatsi 81 karaktereko kate bat. 1–9 emandako gelaxketarako, 0 edo zenbakia ez den edozein karaktere zuriunea izan ezik gelaxka hutsetarako. PuMoKuk Sudokua ebatz daitekeen aztertuko eta maila kalkulatuko du. Lerro-jauziak eta zuriuneak ezer esan gabe kenduko dira, lerroko errenkada bat, nahi dituzun zuriuneekin, sartu ahal izan dezazun.
fi: Syötä tai liitä 81-merkkinen merkkijono. Annetuille soluille 1–9, 0 tai mikä tahansa ei-numeromerkki paitsi välilyönti kelpaa tyhjille soluille. PuMoKu tarkistaa, onko sudoku ratkaistavissa, ja laskee vaikeuden. Rivinvaihdot ja sanavälit poistetaan hiljaisesti, jotta rivin kerrallaan voi antaa valinnaisella tyhjeellä.
fr: Veuillez saisir ou coller une chaîne de 81 caractères. 1-9 pour les cellules données, un caractère non numérique (sauf l'espace) ou 0 correspondra aux cellules vides. PuMoKu vérifiera que le sudoku peut être résolu et calculera le niveau. Les sauts de ligne et les espaces sont supprimés, de sorte que vous pouvez saisir une rangée par ligne avec des espaces en option.
he: נא למלא או להדביק מחרוזת של 81 תווים. 1‏–9 לתאים נתונים, 0 או כל תו שאינו ספרה למעט רווח יספיק לציון תאים ריקים. PuMoKu יבדוק שהסודוקו פתיר ויחשב את הרמה. ירידות שורה ורווחים נמחקים בסתר, כדי לאפשר לך למלא שורה בקובץ עם רווחים כראות עיניך או עינייך.
it: Inserisci o incolla una stringa di 81 caratteri. Da 1 a 9 per le celle specificate, zero o qualsiasi carattere non numerico, tranne lo spazio, andranno bene per le celle vuote. PuMoKu verificherà che il Sudoku sia risolvibile e calcolerà il livello. Le interruzioni di riga e gli spazi vengono rimossi automaticamente, in modo da poter inserire una riga alla volta con qualche spaziatura facoltativa.
ka: შეიყვანეთ ან ჩასვით 81 სიმბოლო. 1-9 მითითებული უჯრედებისთვის, 0 ან ერთი არარიცხვითი სიმბოლო ჰარეს გარდა ცარიელი უჯრედებისთვის PuMoKu შეამოწმებს, არის თუ არა სუდოკუ ამოხსნადი და გამოთვლის დონეს. ხაზის გადატანები და ჰარეები ხმის ამოუღებლად იშლება, ასე რომ შეგიძლიათ, შეიყვანოთ ერთი მწკრივი თითოეულ ხაზზე დამატებითი არასავალდებულო ჰარეებით.
nl: Voer in of plak een tekenreeks van 81 tekens. 1-9 voor gegeven cellen, 0 of elk enkel niet-numeriek teken behalve spatie voldoet voor lege cellen. PuMoKu zal controleren of de Sudoku oplosbaar is en het niveau berekenen. Regelafbrekingen en spaties worden stilletjes verwijderd, zodat u één rij per regel kunt invoeren met enige optionele witruimte.
pt_br: Digite ou cole uma sequência de 81 caracteres. Use de 1 a 9 para as células indicadas e zero ou qualquer caractere único não numérico, exceto espaço, para células em branco. O PuMoKu verificará se o sudoku é solucionável e calculará o nível. Quebras de linha e espaços são removidos silenciosamente, permitindo que você insira uma linha por linha, com espaços em branco opcionais.
sl: Vnesite ali prilepite niz 81 znakov. Za dane celice uporabite številke od 1 do 9, za prazne celice pa nič ali kateri koli neštevilski znak, razen presledka. PuMoKu bo preveril, ali je sudoku rešljiv, in izračunal raven. Prelomi vrstic in presledki se potihem odstranijo, tako da lahko vnesete po eno vrstico na vrstico z nekaj neobveznimi presledki.
tr: 81 karakterlik bir dizi girin veya yapıştırın. Verilen hücreler için 1–9, boşluk hücreleri için 0 veya boşluk dışında herhangi bir sayısal olmayan karakter yeterli olacaktır. PuMoKu, Sudoku’nun çözülebilir olup olmadığını denetleyecek ve düzeyi hesaplayacaktır. Satır sonları ve boşluklar sessizce kaldırılır, böylece isteğe bağlı olarak boşluk bırakarak her satıra bir satır girebilirsiniz.
uk: Введіть або вставте рядок із 81 символу. Для заданих комірок використовуються символи від 1 до 9, для порожніх комірок – нуль або будь-який нечисловий символ, окрім пробілу. PuMoKu перевірить, чи судоку можна розв'язати, та розрахує рівень. Розриви рядків та пробіли буде без попередження вилучено, тож ви можете ввести один рядок на рядок з будь-якими необов'язковими пробілами.

# @action:button
source: Cancel
ar: ألغِ
ca: Cancel·la
de: Abbrechen
es: Cancelar
eu: Utzi
fi: Peru
fr: Annuler
he: ביטול
it: Annulla
ka: გაუქმება
nl: Annuleren
pt_br: Cancelar
sl: Prekliči
tr: İptal
uk: Скасувати

# @action:button
source: Import
ar: استورد
ca: Importa
de: Importieren
es: Importar
eu: Inportatu
fi: Tuo
fr: Importer
he: ייבוא
it: Importa
ka: შემოტანა
nl: Importeren
pt_br: Importar
sl: Uvozi
tr: İçe Aktar
uk: Імпортувати

source: The provided string is not exactly 81 characters after cleanup. Please amend.
ar: السلسلة المقدمة لا تحتوي على 81 حرفًا بالضبط بعد التنظيف. يرجى تعديلها.
ca: La cadena proporcionada no té exactament 81 caràcters després de la neteja. Corregiu-ho.
de: Die eingegebene Zeichenkette ist nach der Bereinigung nicht exakt 81 Zeichen lang. Bitte korrigieren Sie Ihre Eingabe.
es: La cadena que has introducido no tiene exactamente 81 caracteres tras procesarla. Tendrás que corregirla.
eu: Emandako katea, garbitu ondoren, ez da zehazki 81 karakterekoa. Zuzendu mesedez.
fi: Tarjottu merkkijono ei siivouksen jälkeen ole tasan 81-merkkinen. Korjaa.
fr: La chaîne fournie ne contient pas exactement 81 caractères après nettoyage. Veuillez corriger.
he: המחרוזת שסופקה היא לא בדיוק 81 תווים לאחר הניקוי. נא לשפר.
it: Dopo la pulizia, la stringa fornita non è esattamente lunga 81 caratteri. Correggila.
ka: შეყვანილი სტრიქონი გასუფთავების შემდეგ ზუსტად 81 სიმბოლოს არ შეიცავს. გაასწორეთ ის, გეთაყვა.
nl: De geleverde tekenreeks is niet exact 81 tekens na opschonen. Graag aanvullen.
pt_br: A sequência de caracteres fornecida não possui exatamente 81 caracteres após a limpeza. Por favor, corrija.
sl: Navedeni niz po čiščenju nima natanko 81 znakov. Prosimo, popravite ga.
tr: Temizlikten sonrası bakıldığında, sağlanan dizi tam olarak 81 karakterden oluşmuyor. Lütfen düzeltin.
uk: Після чищення наданий рядок не складається точно з 81 символу. Будь ласка, виправте його.

# @action:button
source: Give Up Active Game?
es: ¿Abandonar el juego activo?
tr: Etkin Oyunu Bırak?

source: Pumoku does not save your game yet. Closing the app means giving up.
es: PuMoKu no ha guardado el juego activo. Cerrar la aplicación equivale a abandonar.
tr: Pumoku henüz oyununuzu kaydetmiyor. Uygulamayı kapatmak, pes etmek anlamına geliyor.
zh_tw: Pumoku 目前還無法儲存遊戲。關閉遊戲代表放棄。

# @action:inmenu
source: Main Menu
es: Menú principal
tr: Ana Menü

# @action:inmenu
source: Settings
es: Preferencias
tr: Ayarlar

# @action:inmenu
source: About PuMoKu
es: Acerca de PuMoKu
tr: PuMoKu Hakkında

# @action:inmenu
source: Quit
es: Salir
tr: Çık

# @title:window
source: Main Menu
es: Menú principal
tr: Ana Menü

# @title
source: Welcome to PuMoKu
es: Bienvenido a PuMoKu
tr: PuMoKu’ya hoş geldiniz

# @action:button
source: Solve a Sudoku
es: Resolver un sudoku
tr: Sudoku Çöz

# @action:button
source: Continue…
es: Continuar…
tr: Sürdür…

# @action:button
source: Import…
es: Importar…
tr: İçe Aktar

# @title:window
source: Settings
ar: إعدادات
ca: Configuració
de: Einstellungen
es: Preferencias
eu: Ezarpenak
fi: Asetukset
fr: Réglages
he: הגדרות
it: Impostazioni
ka: მორგება
nl: Instellingen
pt_br: Configurações
sl: Nastavitve
tr: Ayarlar
uk: Параметри
zh_tw: 設定

# @title
source: Game
ar: لعبة
ca: Partida
de: Spiel
es: Juego
eu: Jokoa
fi: Peli
fr: Partie
he: משחק
it: Partita
ka: თამაში
nl: Spel
pt_br: Jogo
sl: Igra
tr: Oyun
uk: Гра

# @label:listbox
source: Input method
es: Método de entrada
tr: Giriş yöntemi
uk: Спосіб введення

# @item:inlistbox
source: Hybrid
es: Híbrido
tr: Hibrit
uk: Гібридне

# @item:inlistbox
source: Digit, then cell
es: Dígito, luego celda
tr: Rakam, sonra hücre
uk: Цифра, потім комірка

# @item:inlistbox
source: Cell, then digit
es: Celda, luego dígito
tr: Hücre, sonra rakam
uk: Комірка, потім цифра

# @option:check
source: Reset time with game
ar: صفّر الوقت مع اللعبة
ca: Reinicia el temps amb la partida
de: Zeit mit Spiel zurücksetzen
es: Reiniciar tiempo con el juego
eu: Jokoarekin denbora berrezarri
fi: Nollaa peliaika
fr: Réinitialiser le temps de la partie
he: לאפס את הזמן עם המשחק
it: Azzera il tempo con il gioco
ka: თამაშის დროის ჩამოყრა
nl: Tijd met spel resetten
pt_br: Reiniciar o tempo com o jogo
sl: Ponastavi čas igre
tr: Oyun ile zamanı sıfırla
uk: Скидати час зі зміною гри
