Repository: KDE/pumoku
Catalog: po/*/pumoku.po
Languages: ar, ca, de, es, eu, fi, fr, he, it, ka, nl, pt_br, sl, tr, uk, zh_tw

# @option:check
source: Clean up pencil marks when setting a cell value
ar: امسح علامات القلم الرصاص عند تعيين قيمة الخلية
ca: Neteja les marques de llapis quan s'estableixi un valor de cel·la
de: Hilfszahlen leeren, wenn eine Zahl in eine Zelle eingetragen wird
es: Borrar las marcas de lápiz al definir un valor para la celda
eu: Garbitu arkatz-markak gelaxka bateko balioa ezartzean
fi: Pyyhi kynänjäljet solun arvon asettamisen jälkeen
fr: Nettoyer les marques lors de la saisie d'une valeur de cellule
he: למחוק את סימוני העיפרון בעת הגדרת ערך לתא
it: Pulisci i segni a matita quando imposti un valore di cella
ka: ფანქრის ნიშნების გასუფთავება უჯრედის მნიშვნელობის დაყენებისას
nl: Potloodmarkeringen wissen bij zetten van een waarde in de cel
pt_br: Remover as marcas de lápis ao definir o valor de uma célula
sl: Počisti oznake svinčnika pri nastavljanju vrednosti celice
tr: Hücre değeri ayarlarken kalem imlerini temizle
uk: Знімати позначки олівцем при встановлення значення у комірці

# @title
source: Highlight
ar: الإبراز
ca: Ressaltat
de: Hervorheben
es: Resaltar
eu: Nabarmendu
fi: Korosta
fr: Surligner
he: הדגשה
it: Evidenzia
ka: გამოკვეთა
nl: Accentueren
pt_br: Realce
sl: Označi
tr: Vurgu
uk: Підсвічування

# @option:check
source: Houses of a selected cell
ar: منازل خلية محددة
ca: Cases d'una cel·la seleccionada
de: Quadrate einer ausgewählten Zelle
es: Casas de una celda seleccionada
eu: Hautatutako gelaxkaren multzoak
fr: Maisons d'une cellule sélectionnée
he: בתים של התא הנבחר
it: Case di una cella selezionata
ka: შეიცავს მონიშნულ უჯრედს
nl: Huizen van een geselecteerde cel
pt_br: Casas de uma célula selecionada
sl: Hiše izbrane celice
tr: Seçili hücrelerin yerleri
uk: Місця позначеної комірки

# @option:check
source: Cells with active digit
ar: الخلايا ذات الرقم النشط
ca: Cel·les amb dígit actiu
de: Zellen mit ausgewählter Zahl
es: Celdas con un dígito activo
eu: Digitu aktiboa duten gelaxkak
fi: Solut, joissa on aktiivinen numero
fr: Cellules avec chiffre actif
he: תאים עם ספרה פעילה
it: Celle con cifra attiva
ka: უჯრედები აქტიური ციფრით
nl: Cellen met actief cijfer
pt_br: Células com dígito ativo
sl: Celice z aktivno številko
tr: Etkin rakamlı hücreler
uk: Комірки з активною цифрою

# @option:check
source: Cells with active digit pencilmark
ar: خلايا ذات علامات قلم رصاص رقمية نشطة
ca: Cel·les amb marca de llapis de dígit actiu
de: Zellen mit ausgewählter Zahl als Hilfszahl
es: Celdas con marca de lápiz de dígito activa
eu: Hautatutako digitua arkatz-ohar gisa duten gelaxkak
fi: Solut, joissa on aktiivinen numerokynänjälki
fr: Cellules avec marque active
he: תאים עם סימון עיפרון של הספרה הפעילה
it: Celle con segno a matita per cifre attive
ka: უჯრედები აქტიური ციფრის ფანქრის ნიშნით
nl: Cellen met actief cijfer als potloodmarkering
pt_br: Células com marca de lápis de dígito ativo
sl: Celice z aktivno številko označeno svinčnikom
tr: Etkin kalem imli hücreler
uk: Комірки з активною позначкою цифри олівцем

# @option:check
source: Logical errors in values
ar: أخطاء منطقية في القيم
ca: Errors lògics als valors
de: Logische Fehler bei ausgefüllten Zahlen
es: Errores lógicos en los valores
eu: Akats logikoak balioetan
fi: Arvojen loogiset virheet
fr: Erreurs de logique dans les valeurs
he: שגיאות לוגיות בערכים
it: Errori logici nei valori
ka: ლოგიკური შეცდომები მნიშვნელობებში
nl: Logische fouten in waarden
pt_br: Erros lógicos nos valores
sl: Logične napake v vrednostih
tr: Değerlerdeki mantık hataları
uk: Логічні помилки у значеннях

# @option:check
source: Logical errors in pencilmarks
ar: أخطاء منطقية في علامات القلم الرصاص
ca: Errors lògics a les marques de llapis
de: Logische Fehler bei Hilfszahlen
es: Errores lógicos en las marcas de lápiz
eu: Arkatz-marketan akats logikoak
fi: Kynänjälkien loogiset virheet
fr: Erreurs de logique dans les marques
he: שגיאות לוגיות בסימוני העיפרון
it: Errori logici nei segni a matita
ka: ლოგიკური შეცდომები ფანქრების ნიშნებში
nl: Logische fouten in potloodmarkeringen
pt_br: Erros lógicos nas marcas de lápis
sl: Logične napake v oznakah svinčnika
tr: Kalem imlerindeki mantık hataları
uk: Логічні помилки у позначках олівцем

# @option:check
source: Erasable cells with eraser active
ar: خلايا قابلة للمسح مع ممحاة نشطة
ca: Cel·les esborrables amb la goma d'esborrar activa
de: Löschbare Zellen bei aktivierter Löschfunktion
es: Celdas borrables con el borrador activo
eu: Ezabatzekoa aktibo duten gelaxka ezabagarriak
fi: Pyyhittävissä olevat soluja ja käytössä oleva pyyhekumi
fr: Cellules effaçables avec gomme active
he: תאים שאפשר למחוק עם מחק פעיל
it: Celle cancellabili con gomma attiva
ka: აქტიური საშლელის მქონე წაშლადი უჯრედები
nl: Wisbare cellen met actieve wisser
pt_br: Células apagáveis ​​com função de apagar ativa
sl: Brisanje celic z aktivno radirko
tr: Silgi etkinken silinebilir hücreler
uk: Придатні до витирання комірки із активною гумкою

# @option:check
source: Wrong values
ar: قيم خاطئة
ca: Valors erronis
de: Falsche Werte
es: Valores erróneos
eu: Balio okerrak
fi: Väärät arvot
fr: Mauvaises valeurs
he: ערכים שגויים
it: Valori errati
ka: არასწორი მნიშვნელობები
nl: Verkeerde waarden
pt_br: Valores errados
sl: Napačne vrednosti
tr: Yanlış değerler
uk: Помилкові значення

source: PuMoKu is a classic Sudoku game, aimed for Plasma Mobile
ar: بوموكو هي لعبة سودوكو كلاسيكية مخصصة لأجهزة بلازما الجوال.
ca: El PuMoKu és un joc de Sudoku clàssic, destinat al Plasma Mobile
de: PuMoKu ist ein klassisches Sudoku-Spiel, optimiert für Plasma Mobile
es: PuMoKu es el clásico juego de sudoku para móviles
eu: PuMoKu Plasma Mugikorrerako pentsatuta dagoen Sudoko joko klasiko bat da
fi: PuMoKu on Plasma Mobileen tarkoitettu perinteinen sudokupeli
fr: PuMoKu est un jeu de sudoku classique à destination de Plasma mobile
he: PuMoKu הוא משחק סודוקו קלסי, שמיועד לפלזמה לניידים.
it: PuMoKu è un classico gioco di Sudoku, sviluppato per Plasma Mobile
ka: PuMoKu არის კლასიკური სუდოკუს თამაში, რომელიც შემუშავებულია Plasma Mobile-ისთვის
nl: PuMoKu is een klassiek Sudoku spel, gericht op Plasma mobiel
pt_br: PuMoKu é um clássico jogo de Sudoku, desenvolvido para o Plasma Mobile.
sl: PuMoKu je klasična igra sudoku namenjena za mobilne naprave
tr: PuMoKu; Plasma Cep için tasarlanmış, klasik Sudoku oyunu
uk: PuMoKu — класична гра у судоку, розроблена для мобільної Плазми

source: © 2025 KDE Developers
ar: © 2025 مطوري كِيدِي
de: © 2025 KDE-Entwickler
es: © 2025 Los desarrolladores de KDE
eu: © 2025 KDE Garatzaileak
fi: © 2025 KDE-kehittäjät
fr: © 2025 les développeurs KDE
he: © 2025 מפתחי KDE
it: © 2025 Gli sviluppatori di KDE
ka: © 2025 KDE-ის პროგრამისტები
nl: © 2025 ontwikkelaars van KDE
pt_br: © 2025, Os desenvolvedores do KDE
sl: © 2025 Razvijalci KDE
tr: © 2025 KDE Geliştiricileri
uk: © Розробники KDE, 2025

# @info:credit
source: Maintainer
ar: الصائن
ca: Mantenidor
de: Betreuer
es: Responsable
eu: Mantentzailea
fi: Ylläpitäjä
fr: Mainteneur
he: מתחזק
it: Responsabile
ka: წამყვანი პროგრამისტი
nl: Onderhouder
pt_br: Mantenedor
sl: Vzdrževalec
tr: Bakımcı
uk: Супровідник
zh_tw: 維護者

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
ca: Josep M. Ferrer
de: Deutsches KDE-Übersetzungsteam
es: Eloy Cuadra
eu: Iñigo Salvador Azurmendi
fi: Tommi Nieminen
fr: Thomas Vergnaud
he: צוות התרגום של KDE ישראל
it: Vincenzo Reale
ka: Temuri Doghonadze
nl: Freek de Kruijf - 2025
pt_br: Marcus Gama
sl: Matjaž Jeran
tr: Emir SARI
uk: Юрій Чорноіван
zh_tw: Kisaragi Hiu

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
ca: txemaq@gmail.com
de: kde-i18n-de@kde.org
es: ecuadra@eloihr.net
eu: xalba@ni.eus
fi: translator@legisign.org
fr: thomas.vergnaud@mailo.eu
he: kde-l10n-he@kde.org
it: smart2128vr@gmail.com
ka: Temuri.doghonadze@gmail.com
nl: freekdekruijf@kde.nl
pt_br: marcus.gama@gmail.com
sl: matjaz.jeran@amis.net
tr: emir_sari@icloud.com
uk: yurchor@ukr.net
zh_tw: mail@kisaragi-hiu.com

source: UNKNOWN
ar: مجهول
ca: DESCONEGUDA
de: UNBEKANNT
es: Desconocido
eu: EZEZAGUNA
fi: TUNTEMATON
fr: INCONNU
he: לא ידוע
it: SCONOSCIUTO
ka: უცნობი
nl: ONBEKEND
pt_br: DESCONHECIDO
sl: NEZNANO
tr: BİLİNMİYOR
uk: НЕВІДОМА
zh_tw: 未知

source: Simple
ar: بسيط
ca: Senzill
de: Simpel
eu: Sinplea
fi: Yksinkertainen
he: פשוט
it: Semplice
ka: მარტივი
nl: Eenvoudig
pt_br: Simples
sl: Preprosto
tr: Basit
uk: Проста
zh_tw: 精簡

source: Easy
ar: سهل
ca: Fàcil
de: Einfach
es: Fácil
eu: Erraza
fi: Helppo
fr: Facile
he: קל
it: Facile
ka: ადვილი
nl: Gemakkelijk
pt_br: Fácil
sl: Lahko
tr: Kolay
uk: Легка
zh_tw: 容易

source: Intermediate
ar: متوسط
ca: Intermedi
de: Durchschnittlich
es: Intermedio
eu: Tartekoa
fi: Keskivaikea
fr: Intermédiaire
he: ביניים
it: Intermedio
ka: შუალედური
nl: Tussenliggend
pt_br: Intermediário
sl: Srednje zahtevno
tr: Orta
uk: Середня
zh_tw: 中等

source: Expert
ar: خبير
de: Experte
es: Experto
eu: Aditua
fi: Asiantuntija
he: מומחים
it: Esperto
ka: ექსპერტი
pt_br: Especialista
sl: Napredno
tr: Uzman
uk: Експерт
zh_tw: 專家

source: None
ar: لا شيء
ca: Cap
de: Kein
es: Ninguno
eu: Bat ere ez
fi: Ei mitään
fr: Aucune
he: ללא
it: Nessuno
ka: არაფერი
nl: Geen
pt_br: Nenhum
sl: Brez
tr: Yok
uk: Немає
zh_tw: 無

source: Rotate 90°
ar: دوّر 90°
ca: Gira 90°
de: Um 90° drehen
es: Rotar 90°
eu: Biratu 90º
fi: Kierrä 90°
fr: Pivoter à 90°
he: סיבוב ב־90°
it: Ruota di 90°
ka: 90°-ით მობრუნება
nl: 90° draaien
pt_br: Girar 90°
sl: Zavrti za 90°
tr: 90° Döndür
uk: Обернути на 90°
zh_tw: 旋轉 90°

source: Rotate 180°
ar: دوّر 180°
ca: Gira 180°
de: Um 180° drehen
es: Rotar 180°
eu: Biratu 180°
fi: Kierrä 180°
fr: Pivoter à 180°
he: סיבוב ב־180°
it: Ruota di 180°
ka: 180°-ით მობრუნება
nl: 180° draaien
pt_br: Girar 180°
sl: Zavrti za 180°
tr: 100° Döndür
uk: Обернути на 180°

source: Mirror
ar: مرآة
ca: Emmiralla
de: Spiegeln
es: Reflejar
eu: Ispilatu
fi: Peilaa
fr: Miroir
he: שיקוף מראה
it: Rispecchia
ka: სარკე
nl: Spiegelen
pt_br: Espelhar
sl: Zrcali
tr: Yansıt
uk: Віддзеркалити
zh_tw: 鏡像

source: Flip
ar: اقلب
ca: Inverteix
de: Umdrehen
es: Invertir
eu: Irauli
fi: Pyöräytä
fr: Retournement
he: היפוך
it: Ribalta
ka: გადაბრუნება
nl: Verticaal spiegelen
pt_br: Inverter
sl: Obrni
tr: Ters Döndür
uk: Перевернути
zh_tw: 翻轉

source: Random
ar: عشوائي
ca: Aleatori
de: Zufällig
es: Aleatorio
eu: Ausazkoa
fi: Satunnainen
fr: Aléatoire
he: אקראי
it: Casuale
ka: შემთხვევითი
nl: Willekeurig
pt_br: Aleatório
sl: Naključno
tr: Rastgele
uk: Випадковий
zh_tw: 隨機

source: Looking good. Difficulty:
ar: تبدو جيدة. الصعوبة:
ca: Sembla correcte. Dificultat:
de: Sieht gut aus. Schwierigkeitsgrad:
es: Parece correcto. Dificultad:
eu: Itxura ona du. Zailtasuna:
fi: Hyvältä näyttää. Vaikeus:
fr: Ça semble correct. Difficulté :
he: נראה טוב. רמת קושי:
it: Sembra buono. Difficoltà:
ka: კარგად გამოიყურება. სირთულე:
nl: Ziet er goed uit. Moeilijkheidsgraad:
pt_br: Parece bom. Dificuldade:
sl: Videti je dobro. Težavnost:
tr: Güzel görünüyor. Zorluk:
uk: Усе добре. Складність:

source: The provided Sudoku does not have a unique solution.
ar: السودوكو المقدم لا يحتوي على حل فريد.
ca: El Sudoku proporcionat no té una solució única.
de: Das angeegbene Sudoku hat keine eindeutige Lösung.
es: El sudoku proporcionado no tiene una única solución.
eu: Eskainitako Sudokuak ez du ebazpen bakarra.
fi: Tarjotulla sudokulla ei ole ainutkertaista ratkaisua.
fr: Le sudoku fourni n'a pas de solution unique.
he: לסודוקו שסופק אין פתרון ייחודי.
it: Il Sudoku fornito non ha una soluzione univoca.
ka: მოწოდებულ სუდოკუს უნიკალური ამოხსნა არ გააჩნია.
nl: De gegeven Sudoku heeft geen unieke oplossing.
pt_br: O sudoku fornecido não possui uma solução única.
sl: Podani sudoku nima enolične rešitve.
tr: Sağlanan Sudoku’nun benzersiz bir çözümü yok.
uk: Надане судоку не має однозначного розв'язку.

source: The provided Sudoku is not solvable.
ar: السودوكو المقدم غير قابل للحل.
ca: El Sudoku proporcionat no es pot solucionar.
de: Das angegebene Sudoku ist nicht lösbar.
es: El sudoku proporcionado no se puede resolver.
eu: Emandako Sudokua ezin da ebatzi.
fi: Tarjottu sudoku ei ole ratkaistavissa.
fr: Le sudoku fourni n'est pas soluble.
he: הסודוקו שסופק אינו פתיר.
it: Il Sudoku fornito non è risolvibile.
ka: მოწოდებული სუდოკუ ამოხსნადი არაა.
nl: De gegeven Sudoku is niet op te lossen.
pt_br: O sudoku fornecido não pode ser resolvido.
sl: Podani sudoku ni rešljiv.
tr: Sağlanan Sudoku çözülebilir değil.
uk: Надане судоку не можна розв'язати.

source: Please select a valid cell to solve.
ar: رجاءً اختر خلية صالحة لحلها.
ca: Seleccioneu una cel·la vàlida a solucionar.
de: Bitte wählen Sie eine gültige zu lösende Zelle aus.
eu: Mesedez, hautatu ebazteko balio duen gelaxka bat.
fi: Valitse ratkaistavaksi kelvollinen solu.
fr: Veuillez sélectionner une cellule valable à résoudre.
it: Seleziona una cella valida da risolvere.
ka: აირჩიეთ სწორი უჯრედი ამოსახსნელად.
nl: Selecteer een geldige cel om op te lossen.
sl: Izberite veljavno celico za reševanje.

source: Solve
ar: حلّ
ca: Soluciona
de: Lösen
eu: Ebatzi
fi: Ratkaise
fr: Résoudre
it: Risolvi
ka: ამოხსნა
nl: Oplossen
sl: Reši

# @button:title
source: Save current game
ar: احفظ اللعبة الحالية
ca: Desa la partida actual
de: Aktuelles Spiel speichern
eu: Gorde uneko jokoa
fi: Tallenna nykyinen peli
fr: Enregistrer la partie en cours
he: שמירת המשחק הנוכחי
it: Salva la partita attuale
ka: მიმდინარე თამაშის შენახვა
nl: Huidige spel opslaan
pt_br: Salvar jogo atual
sl: Shrani trenutno igro

source: PuMoKu
ar: بوموكو

# @title:window
source: Pumoku Menu
ar: قائمة بوموكو
ca: Menú del Pumoku
de: PuMoKu-Menü
eu: Pumoku Menua
fi: Pumokun valikko
fr: Menu Pumoku
he: תפריט Pumoku
it: Menu di Pumoku
ka: Pumoku-ის მენიუ
pt_br: Menu Pumoku
sl: Pumoku Meni
uk: Меню Pumoku

source: Save game?
ar: احفظ لعبة؟
ca: Deso la partida?
de: Spiel speichern?
eu: Jokoa gorde?
fi: Tallennetaanko peli?
fr: Enregistrer la partie ?
he: לשמור את המשחק?
it: Vuoi salvare la partita?
ka: შევინახო თამაში?
nl: Spel opslaan?
pt_br: Salvar jogo?
sl: Naj shranim igro?

source: Would you like to save the current game, so it can be continued later?
ar: هل ترغب في حفظ اللعبة الحالية حتى تتمكن من متابعتها لاحقًا؟
ca: Voleu desar la partida actual de manera que es pugui continuar més tard?
de: Möchten Sie das aktuelle Spiel speichern, um es später weiterzuspielen?
eu: Uneko jokoa geroago jokatu ahal izateko gorde nahi duzu?
fi: Haluaisitko tallentaa nykyisen pelin, jotta sitä voi tuonnempana jatkaa?
fr: Voulez-vous enregistrer la partie en cours afin de la continuer plus tard ?
he: לשמור את המשחק הנוכחי כדי להמשיך לשחק בו אחר כך?
it: Vuoi salvare la partita in corso per poterla continuare in seguito?
ka: გნებავთ, შეინახოთ ეს თამაში მოგვიანებით გასაგრძელებლად?
nl: Wilt u het huidige spel opslaan, zodat het later door kan gaan?
pt_br: Deseja salvar o jogo atual para poder continuá-lo mais tarde?
sl: Ali želite shraniti trenutno igro, da jo boste lahko nadaljevali kasneje?

source: New Sudoku:
ar: سودوكو جديد:
ca: Sudoku nou:
de: Neues Sudoku:
eu: Sudoku berria:
fi: Uusi sudoku:
fr: Nouveau sudoku :
he: סודוקו חדש:
it: Nuovo Sudoku:
ka: ახალი სუდოკუ:
nl: Nieuwe Sudoku:
pt_br: Novo sudoku:
sl: Novi Sudoku:
uk: Нове судоку:

source: Import or enter:
ar: استورد أو أدخل:
ca: Importeu o introduïu:
de: Importieren oder eingeben:
eu: Inportatu edo sartu:
fi: Tuo tai anna:
fr: Importer ou saisir :
he: לייבא או להקליד:
it: Importa o inserisci:
ka: შემოტანა ან შესვლა:
nl: Importeer of voer in:
pt_br: Importar ou inserir:
sl: Uvozite ali vnesite:
uk: Імпортуйте або введіть:

# @action:button
source: Import Sudoku …
ar: استورد سودوكو …
ca: Importeu un Sudoku…
de: Sudoku importieren …
eu: Inportatu Sudoku …
fi: Tuo sudoku…
fr: Importer un sudoku…
he: ייבוא סודוקו…
it: Importa Sudoku …
ka: სუდოკუს შემოტანა …
nl: Sudoku importeren…
pt_br: Importar sudoku …
sl: Uvozi Sudoku …
uk: Імпортувати судоку…

# @action:button
source: Enter Sudoku …
ar: ادخل سودوكو…
ca: Introduïu un Sudoku…
de: Sudoku eingeben …
eu: Sartu Sudoku …
fi: Anna sudoku…
fr: Saisir un sudoku…
he: הקלדת סודוקו…
it: Inserisci Sudoku…
ka: სუდოკუში შესვლა …
nl: Sudoku invoeren…
pt_br: Inserir sudoku …
sl: Vnesite Sudoku …
uk: Ввести судоку…

# @action:button
source: Continue:
ar: تابع:
ca: Continua:
de: Fortfahren:
eu: Jarraitu:
fi: Jatka:
fr: Continuer :
he: להמשיך:
it: Continua:
ka: გაგრძელება:
nl: Doorgaan:
pt_br: Continuar:
sl: Nadaljuj:

# @title
source: PuMoKu
ar: بوموكو

# @info:credit
source: Anders Lund
ar: أندرس لوند
he: אנדרס לונד
uk: Андерс Лунд

source: There is your solution.
zh_tw: 這是您的解法。

source: Undo
zh_tw: 復原

source: Redo
zh_tw: 重做

source: Hint
zh_tw: 提示

source: Solve cell
zh_tw: 提供方格解答

source: Set pencilmarks
zh_tw: 設定鉛筆標記

source: Pencil
zh_tw: 鉛筆

source: Erase
zh_tw: 抹除

source: Game
zh_tw: 遊戲

source: Reset game
zh_tw: 重設遊戲

source: Reset game?
zh_tw: 重設遊戲？

source: You loose any changes you have made, reset can't be undone.
zh_tw: 您將會喪失任何您所做的變更，重設將無法復原。

source: Clear pencilmarks
zh_tw: 清除鉛筆標記

source: Give up
zh_tw: 放棄

source: Give up?
zh_tw: 放棄？

source: Giving up means that you loose any changes you have made, it can't be undone.
zh_tw: 放棄代表您將會喪失任何您所做的變更，而無法復原。

source: Solve game
zh_tw: 提供遊戲解答

source: Are you sure??
zh_tw: 您確定嗎？

source: Main menu
zh_tw: 主選單

source: Import sudoku
zh_tw: 匯入數獨

source: Cancel
zh_tw: 取消

source: Import
zh_tw: 匯入

source: The provided string is not exactly 81 characters after cleanup. Please fix.
zh_tw: 指定的字串長度在清理之後並不是 81 個字元長。請修正它。

source: Give up active game?
zh_tw: 放棄目前遊戲？

source: Settings
zh_tw: 設定

source: About PuMoKu
zh_tw: 關於 PuMoKu

source: Quit
zh_tw: 離開

# @title:window
source: Main menu
zh_tw: 主選單

source: Solve a sudoku
zh_tw: 解決數獨

source: Input method
zh_tw: 輸入方法

source: Hybrid
zh_tw: 混合

source: Digit, then cell
zh_tw: 數字然後方格

source: Cell, then digit
zh_tw: 方格然後數字

source: Reset time with game
zh_tw: 重設遊戲時也重設時間

source: Clean up pencil marks when setting a cell value
zh_tw: 設定方格值時清理鉛筆標記

source: Highlight
zh_tw: 突顯

source: Houses of a selected cell
zh_tw: 所選方格的直行、橫列與粗線宮

source: Cells with active digit
zh_tw: 有作用數的方格

source: Cells with active digit pencilmark
zh_tw: 有作用數鉛筆標記的方格

source: Logical errors in values
zh_tw: 數值的邏輯錯誤

source: Logical errors in pencilmarks
zh_tw: 鉛筆標記的邏輯錯誤

source: Erasable cells with eraser active
zh_tw: 橡皮擦作用中且可以抹除的方格

source: Wrong values
zh_tw: 錯誤數值

source: PuMoKu is a classic sudoku game, developed for mobile.
zh_tw: PuMoKu 是經典的數獨遊戲，為行動裝置設計。

source: rotate 180°
zh_tw: 旋轉 180°

source: Looking good. Difficulty:
zh_tw: 看來沒問題。難度：

source: The provided sudoku does not have a unique solution.
zh_tw: 提供的數獨有超過一種解法。

source: The provided sudoku is not solvable
zh_tw: 提供的數獨不可解
